{"alwaysExternalTips":true,"externalLoadingTips":["Join our Discord!","Love all Pokemons equally! They are trying their best.","We hope you are having fun!","Have you had water today?","Remember to stay hydrated!","Don\u0027t forget to take a break!","Your Pokemons love you!","Each IV has a maximum value of 31.","IVs cannot be changed.","Your Pokemon can get up to a maximum of 510 total EVs and 252 in any single stat.","EVs can be earned through battling.","Pokemons have 6 stats: HP, Attack, Defence, Special Attack, Special Defence, and Speed.","The creator of Pokemon, Satoshi Tajiri, was inspired by his childhood hobby of insect collecting.","Meowth was almost a playable character in the first Super Smash Bros. game.","Pokemon is the highest-grossing media franchise of all time.","Shedinja is the only Pokemon with only 1 health.","Shedinja is the only Pokemon with the ability \u0027Wonder Guard\u0027, which makes it immune to any attack that is not super-effective.","\u0027Ekans\u0027 is \u0027snake\u0027 spelled backward.","Koffing and Weezing were originally going to be named Ny and La, referencing the polluted air of New York and Los Angeles.","Wailord, despite being one of the largest Pokemon, is very light and has a low Body Mass Index, meaning it could theoretically float in the air.","The legendary bird trio (Articuno, Zapdos, Moltres) have names that are puns on the Spanish words for one, two, and three (uno, dos, tres).","The first four regions in the Pokemon games (Kanto, Johto, Hoenn, and Sinnoh) are all based on different regions of Japan.","Fire Type moves are super-effective against Grass, Ice, Bug, and Steel Type Pokemons.","Water Type moves are super-effective against Fire, Ground, and Rock Type Pokemons.","Electric Type moves are super-effective against Water, and Flying Type Pokemons.","Grass Type moves are super-effective against Water, Ground, and Rock Type Pokemons.","Ice Type moves are super-effective against Grass, Ground, Flying, and Dark Type Pokemons.","Fighting Type moves are super-effective against Normal, Ice, Rock, Dark, and Steel Type Pokemons.","Poison Type moves are super-effective against Grass, and Fairy Type Pokemons.","Ground Type moves are super-effective against Fire, Electric, Poison, Rock, and Steel Type Pokemons.","Flying Type moves are super-effective against Grass, Fighting, and Bug Type Pokemons.","Psychic Type moves are super-effective against Fighting, and Poison Type Pokemons.","Bug Type moves are super-effective against Grass, Psychic, and Dark Type Pokemons.","Rock Type moves are super-effective against Fire, Ice, Flying, and Bug Type Pokemons.","Ghost Type moves are super-effective against Psychic, and Ghost Type Pokemons.","Dragon Type moves are super-effective against Dragon Type Pokemons.","Dark Type moves are super-effective against Psychic, and Ghost Type Pokemons.","Steel Type moves are super-effective against Ice, Rock, and Fairy Type Pokemons.","Fairy Type moves are super-effective against Fighting, Dragon, and Dark Type Pokemons.","Normal Type Pokemons are immune to Ghost Type moves!","Ground Type Pokemons are immune to Electric Type moves!","Flying Type Pokemons are immune to Ground Type moves!","Ghost Type Pokemons are immune to Normal and Fighting Type moves!","Dark Type Pokemons are immune to Psychic Type moves!","Steel Type Pokemons are immune to Poison Type moves!","Fairy Type Pokemons are immune to Dragon Type moves!","Pokemons with the ability \u0027Dry Skin\u0027, \u0027Storm Drain\u0027, or \u0027Water Absorb\u0027 are immune to Water Type moves!","Pokemons with the ability \u0027Flash Fire\u0027 are immune to Fire Type moves!","Pokemons with the ability \u0027Levitate\u0027 are immune to Ground Type moves!","Pokemons with the ability \u0027Lightningrod\u0027, or \u0027Motor Drive\u0027 are immune to Electric Type moves!","Pokemons with the ability \u0027Sap Sipper\u0027 are immune to Grass Type moves!","Bulbasaur is based on a frog.","Charmander is based on a salamander.","Squirtle is based on a turtle."]}